/* eslint-disable no-useless-escape */
/**
 * @author zhaowenjie
 * @email [example@mail.com]
 * @create date 2019-05-23 14:07:26
 * @modify date 2019年6月5日14:10:23
 * @desc [正则表达式]
 * @validate https://regexper.com
 */

const Reg = {
  // 校验空内容
  empty: /^\s*$/,
  // 手机号
  phone: /^1((3\d)|(4[579])|(5([0-3]|[5-9]))|66|7(3|[5-8])|(8\d)|(9[89]))\d{8}$/,
  // 邮箱
  email: /^[A-Za-z\d]+([-_.][A-Za-z\d]+)*@([A-Za-z\d]+[-.])+[A-Za-z\d]{2,5}$/,
  // 身份证号
  idCard: /^[1-9]\d{7}((0\d)|(1[0-2]))(([012]\d)|3[0-1])\d{3}$|^[1-9]\d{5}[12]\d{3}((0[1-9])|(1[0-2]))(([012]\d)|3[0-1])\d{3}([\d]|X)$/,
  // 自然数
  number: /^\d+$/,
  // 整数
  int: /^[-]?\d+$/,
  // 正数 + 0
  positiveNumZero: /^\d+(\.\d+)?$/,
  // 正数 不含0
  positiveNum: /^[1-9]\d*(\.\d+)?$/,
  // 正整数
  positiveIntNum: /^[1-9]\d*$/,
  // 正数 只支持最多两位小数
  positiveNumTwoDecima: /^\d+(\.\d{0,2})?$/,
  // 手机号、固定电话
  telephone: /^1((3\d)|(4[579])|(5([0-3]|[5-9]))|66|7(3|[5-8])|(8\d)|(9[89]))\d{8}$|^0\d{9,11}$/,
  // 微信号校验
  wechat: /^[a-zA-Z0-9\-_]{6,20}$/,
  // 包含*的手机号校验
  specialMobile: /^1((3\d)|(4[579])|(5([0-3]|[5-9]))|66|7(3|[5-8])|(8\d)|(9[89]))([0-9\*]{4})\d{4}$/,
  // 包含*的手机号、固话校验
  specialTelephone: /^1((3\d)|(4[579])|(5([0-3]|[5-9]))|66|7(3|[5-8])|(8\d)|(9[89]))([0-9\*]{4})\d{4}$|(^0\d{3,5})([0-9\*]{4})(\d{2})/,
  // 密码 6-20位字母和数字组合
  password: /^(?=.*\d)(?=.*[a-zA-Z])[0-9a-zA-Z]{6,20}$/,
  // 最多n位字母或数字
  numOrLetter: (min = 0, max = 10000) => {
    return new RegExp(`^[0-9a-zA-Z]{${min},${max}}$`);
  },
};

export default Reg;
